Autodesk.Revit.UI.PointCloudSnappingUtilities.GetARCQueryForActiveView(Autodesk.Revit.DB.PointCloudType)
Gets ARCQuery corresponding to the type and active view.
type:
PointCloudType from which to get the ARCQuery
Returns:
The returned pointer can be NULL if the ARCQuery is NULL
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.PointCloudSnappingUtilities.GetVisibleScanGUIDs(Autodesk.Revit.DB.PointCloudInstance,Autodesk.Revit.DB.View)
Given a PointCloudInstance, get those of its scans which are visible in the given view.
pointCloudInstance:
The PointCloudInstance to get scans from.
dbView:
The view in which we search for visible scans of the PointCloudInstance.
Returns:
The GUIDs of the scans of the given PointCloudInstance visible in the given view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.PointCloudSnappingUtilities.GetPlanes(Autodesk.Revit.DB.PointCloudInstance,Autodesk.Revit.DB.View)
Gets the bounding planes for the given point cloud and view.
pointCloudInstance:
The point cloud to find the bounding planes for.
dbView:
The view in which to find the bounding planes for point cloud.
Returns:
The bounding planes for the given point cloud and view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.PointCloudSnappingUtilities.GetReCapNativeAccess(Autodesk.Revit.DB.PointCloudType)
Returns native pointer to IRCData object that corresponds to
a loaded and open point cloud in ReCap SDK
Remarks:
The returned pointer can be NULL if the point cloud has been unloaded
or if this point cloud uses different engine than ReCap
type:
PointCloudType from which to get the IRCData
Returns:
The access pointer
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2024

Autodesk.Revit.UI.PointCloudSnappingUtilities
This is a utilities class for accessing PointClouds.
Since:
2024